In [1]:
import pandas as pd

In [3]:
type(pd.read_html(io = "Home.HTML"))

list

In [13]:
type(pd.read_html(io = "Home.HTML", match = "DO", header = 0)[0])

pandas.core.frame.DataFrame

In [ ]:
pd.read_html(io = "Home.HTML", match = "|")[0]

In [ ]:
pd.read_html(io = 'fifa_players.html')
pd.read_html(io = 'fifa_players.html', match = "ST", header = 0)[0]

In [26]:
len(pd.read_html(io = 'fifa_players.html', match = "ST", header = 0))

1

pd.read_html(io = 'fifa_players.html', match = "ST", header = 2)[0]

In [40]:
pd.read_html(io = "Students.html", match = "NaN", header = 0 , index_col = "Unnamed: 0")[0]

          Hobby  Height  Weight   Age  Marks Grade  Class  Team
Alex     Hiking     NaN      60  27.0     50     B  First   NaN
Emma        NaN   160.0      65  35.0     78     G   Four   NaN
John     Siling     NaN     112   NaN     65     G   Four   NaN
Amelia   Diving   149.0      78   NaN     90     A  Three   NaN
Sophia  Cooking   150.0      80  25.0     38     C  First   NaN

In [39]:
pd.read_html(io = "Students.html", match = "NaN", header = 0, skiprows = [1, 2, 3], index_col = "Unnamed: 0")[0]

          Hobby  Height  Weight   Age  Marks Grade  Class  Team
Amelia   Diving   149.0      78   NaN     90     A  Three   NaN
Sophia  Cooking   150.0      80  25.0     38     C  First   NaN

In [44]:
pd.read_html(io = "Students.html", match = "NaN", header = 0 ,encoding = "utf-8", na_values = "Four")[0]

  Unnamed: 0    Hobby  Height  Weight   Age  Marks Grade  Class  Team
0       Alex   Hiking     NaN      60  27.0     50     B  First   NaN
1       Emma      NaN   160.0      65  35.0     78     G    NaN   NaN
2       John   Siling     NaN     112   NaN     65     G    NaN   NaN
3     Amelia   Diving   149.0      78   NaN     90     A  Three   NaN
4     Sophia  Cooking   150.0      80  25.0     38     C  First   NaN